# Add Homebrew taps for managing packages and applications
tap "homebrew/bundle"         # Allows managing multiple packages and applications with a single Brewfile
tap "homebrew/services"       # Allows managing system services with Homebrew
{{- if .work }}
tap "isen-ng/dotnet-sdk-versions" # Allows different .NET sdk versions that you can install in parallel to the latest version provided by the official cask.
{{ end }}

# Install command-line tools, libraries, and frameworks
{{- if .work }}
brew "azure-cli"
{{ end }}
brew "bitwarden-cli"          # A command-line interface for the Bitwarden password manager
{{- if .work }}
brew "cairo"                  # Vector graphics library with cross-device output support
{{- end }}
brew "chezmoi"                # A tool for managing dotfiles
brew "diff-so-fancy"          # A tool for improving the output of Git diffs
brew "expect"                 # A tool for automating interactive applications
{{- if .work }}
brew "giflib"                 # Library and utilities for processing GIFs
{{- end }}
{{- if .personal }}
brew "git-lfs"                # A Git extension for managing large files
{{- end }}
{{- if .work }}
brew "jpeg"                   # Image manipulation library
{{- end }}
brew "jq"                     # A tool for processing JSON data
{{- if .work }}
brew "mono-libgdiplus"        # GDI+-compatible API on non-Windows operating systems
brew "nvm"                    # A tool to manage multiple Node.js versions
{{- end }}
brew "python@3.9"             # Install Python 3.9
brew "python@3.10"            # Install Python 3.10
brew "httpie"                 # A command-line HTTP client
{{- if .work }}
brew "libpng"                 # Library for manipulating PNG images
brew "librsvg"                # Library to render SVG files using Cairo
{{- end }}
brew "mas"                    # A command-line interface for the Mac App Store
brew "maven"                  # A build automation tool for Java projects
brew "mono"                   # An open-source implementation of Microsoft .NET Framework
brew "nghttp2"                # A library for HTTP/2 and HPACK
brew "node"                   # A JavaScript runtime built on Chrome's V8 JavaScript engine
brew "openjdk"                # An open-source implementation of the Java SE platform
{{- if .work }}
brew "pango"                  # Framework for layout and rendering of i18n text
brew "pkg-config"             # Manage compile and link flags for libraries
{{- end }}
brew "ripgrep"                # A line-oriented search tool that recursively searches directories
brew "tesseract"              # A command-line OCR (Optical Character Recognition) engine
brew "tldr"                   # A collection of simplified and community-driven man pages
brew "tree"                   # A command-line tool to list contents of directories in a structure like format
brew "wget"                   # A command-line tool for downloading files from the web
brew "zsh"                    # A shell with interactive features and syntax highlighting

# Install GUI applications
cask "alfred"                 # A productivity application for macOS
{{- if (eq .hostname "nate-mbp-max") }}
cask "authy"                  # A two-factor authentication application
{{- end }}
{{- if .work }}
cask "azure-data-studio"      # A Data management tool that enables working with SQL Server
{{- end }}
cask "bartender"              # A tool for managing menu bar items on macOS
cask "bbedit"                 # A professional text editor for macOS
cask "beyond-compare"         # A file / folder / text diff tool 
cask "bitwarden"              # A password manager with a GUI client
cask "bluesnooze"             # An application for reducing blue light on macOS
cask "boop"                   # A scriptable scratchpad for developers
cask "brave-browser"          # A privacy-focused web browser
cask "caffeine"               # An application that prevents macOS from going to sleep
{{- if .personal }}
cask "calibre"                # E-book manager and reader
cask "discord"                # Chat and voice app for gamers
{{- end }}
{{- if .work }}
cask "docker"                 # Pack, ship and run any application as a lightweight container
{{- end }}
{{- if (and .personal (not (eq .hostname "nate-mba"))) }}
cask "dotnet-sdk"             # Software development kit for .NET Framework
{{- end }}
{{- if .work }}
cask "dotnet-sdk6-0-400"      # 6.0 version of the Software development kit for .NET Framework
cask "finicky"                # Application for customizing URLs to open in specific browsers
{{- end }}
cask "freedom"                # App for blocking distractions and increasing productivity
{{- if .work }}
cask "google-chrome"          # Google's web browser
{{- end }}
cask "google-drive"           # Cloud storage and file backup app
cask "iterm2"                 # Terminal emulator for macOS
cask "itsycal"                # Calendar app for macOS
cask "jetbrains-toolbox"      # JetBrains Toolbox, an installer and manager for JetBrains IDEs
cask "keka"                   # Compression and decompression app for macOS
cask "mat"                    # Eclipse Memory Analyzer for java heap dumps
{{- if .personal }}
cask "nordvpn"                # Virtual private network (VPN) app for macOS
{{- end }}
cask "notunes"                # App for disabling iTunes launching when a media key is pressed
cask "obsidian"               # Knowledge management and note-taking app
{{- if .personal }}
cask "openmtp"                # Android file transfer tool
cask "openvpn-connect"        # VPN client for macOS
cask "qbittorrent"            # BitTorrent client app for macOS
{{- end }}
cask "sequel-ace"             # SQLite database manager app for macOS
cask "signal"                 # Encrypted messaging and calling app
cask "slack"                  # Team communication and collaboration app
cask "spotify"                # Music streaming service app
{{- if .personal }}
cask "steam"                  # Digital distribution platform for video games
{{- end }}
cask "sublime-text"           # Text editor for macOS
cask "todoist"                # App for managing tasks and to-do lists
{{- if (and .personal (not (eq .hostname "nate-mba"))) }}
cask "unity-hub"              # Unity engine hub for managing different versions of the engine
{{- end }}
cask "visual-paradigm-ce"     # UML diagramming and design tool
cask "vlc"                    # Multimedia player app for macOS
cask "zoom"                   # Video conferencing app for macOS

# Install Mac App Store applications
mas "GIPHY CAPTURE", id: 668208984        # GIF and video screen capture app from the Mac App Store
mas "Hour", id: 569089415                 # Time tracking app from the Mac App Store
mas "Magnet", id: 441258766               # Window manager app from the Mac App Store
mas "Meeter", id: 1510445899              # Video conferencing app from the Mac App Store
mas "Skitch", id: 425955336               # Annotation and markup app from the Mac App Store
mas "Timestamp Converter", id: 738226999  # Date and time converter app from the Mac App Store
